In [1]:
import pandas as pd

In [10]:
x=pd.DataFrame([[1,2,3,4,5],[6,7,8,9,10]],index=[0,1],columns=["a","b","c","d","e"])

In [11]:
x

   a  b  c  d   e
0  1  2  3  4   5
1  6  7  8  9  10

In [12]:
x.info()

<class 'pandas.core.frame.DataFrame'>
Index: 2 entries, 0 to 1
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   a       2 non-null      int64
 1   b       2 non-null      int64
 2   c       2 non-null      int64
 3   d       2 non-null      int64
 4   e       2 non-null      int64
dtypes: int64(5)
memory usage: 96.0 bytes

In [13]:
x.describe()

              a         b         c         d          e
count  2.000000  2.000000  2.000000  2.000000   2.000000
mean   3.500000  4.500000  5.500000  6.500000   7.500000
std    3.535534  3.535534  3.535534  3.535534   3.535534
min    1.000000  2.000000  3.000000  4.000000   5.000000
25%    2.250000  3.250000  4.250000  5.250000   6.250000
50%    3.500000  4.500000  5.500000  6.500000   7.500000
75%    4.750000  5.750000  6.750000  7.750000   8.750000
max    6.000000  7.000000  8.000000  9.000000  10.000000

In [14]:
x.isnull()

       a      b      c      d      e
0  False  False  False  False  False
1  False  False  False  False  False

In [17]:
x.head(1)

   a  b  c  d  e
0  1  2  3  4  5

In [19]:
x.tail(1)

   a  b  c  d   e
1  6  7  8  9  10

In [20]:
x.dropna()

   a  b  c  d   e
0  1  2  3  4   5
1  6  7  8  9  10

In [23]:
x.duplicated()

0    False
1    False
dtype: bool

In [82]:
y=pd.DataFrame({"RollNo":[101,102,104,104 ],"Name":["Raj","Riya","Suresh","Suresh"]},index=[1,2,3,4])

In [83]:
y

   RollNo    Name
1     101     Raj
2     102    Riya
3     104  Suresh
4     104  Suresh

In [74]:
y.info()

<class 'pandas.core.frame.DataFrame'>
Index: 4 entries, 1 to 4
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   RollNo  4 non-null      int64
 1   Name    4 non-null      object
dtypes: int64(1), object(1)
memory usage: 96.0+ bytes

In [75]:
y.describe()

       RollNo
count    4.00
mean   102.75
std      1.50
min    101.00
25%    101.75
50%    103.00
75%    104.00
max    104.00

In [76]:
y.isnull()

   RollNo   Name
1   False  False
2   False  False
3   False  False
4   False  False

In [81]:
y.duplicated()

1    False
2    False
3    False
4     True
dtype: bool

In [89]:
y.drop_duplicates()

   RollNo    Name
1     101     Raj
2     102    Riya
3     104  Suresh

In [95]:
a=pd.read_csv("C:/Users/priya/Downloads/archive/tested.csv")

In [96]:
a

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,0,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,1,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,0,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,0,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,1,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
413,1305,0,3,"Spector, Mr. Woolf",male,NaN,0,0,A.5. 3236,8.0500,NaN,S
414,1306,1,1,"Oliva y Ocana, Dona. Fermina",female,39.0,0,0,PC 17758,108.9000,C105,C
415,1307,0,3,"Saether, Mr. Simon Sivertsen",male,38.5,0,0,SOTON/O.Q. 3101262,7.2500,NaN,S
416,1308,0,3,"Ware, Mr. Frederick",male,NaN,0,0,359309,8.0500,NaN,S
417,1309,0,3,"Peter, Master. Michael J",male,NaN,1,1,2668,22.3583,NaN,C

In [97]:
a.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  418 non-null    int64
 1   Survived     418 non-null    int64
 2   Pclass       418 non-null    int64
 3   Name         418 non-null    object
 4   Sex          418 non-null    object
 5   Age          332 non-null    float64
 6   SibSp        418 non-null    int64
 7   Parch        418 non-null    int64
 8   Ticket       418 non-null    object
 9   Fare         417 non-null    float64
 10  Cabin        91 non-null     object
 11  Embarked     418 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 39.3+ KB

In [98]:
a.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,418.000000,418.000000,418.000000,332.000000,418.000000,418.000000,417.000000
mean,1100.500000,0.363636,2.265550,30.272590,0.447368,0.392344,35.627188
std,120.810458,0.481622,0.841838,14.181209,0.896760,0.981429,55.907576
min,892.000000,0.000000,1.000000,0.170000,0.000000,0.000000,0.000000
25%,996.250000,0.000000,1.000000,21.000000,0.000000,0.000000,7.895800
50%,1100.500000,0.000000,3.000000,27.000000,0.000000,0.000000,14.454200
75%,1204.750000,1.000000,3.000000,39.000000,1.000000,0.000000,31.500000
max,1309.000000,1.000000,3.000000,76.000000,8.000000,9.000000,512.329200

In [99]:
sum(a.Age)

nan

In [100]:
a.isnull()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,False,False,False,False,False,False,False,False,False,False,True,False
1,False,False,False,False,False,False,False,False,False,False,True,False
2,False,False,False,False,False,False,False,False,False,False,True,False
3,False,False,False,False,False,False,False,False,False,False,True,False
4,False,False,False,False,False,False,False,False,False,False,True,False
...,...,...,...,...,...,...,...,...,...,...,...,...
413,False,False,False,False,False,True,False,False,False,False,True,False
414,False,False,False,False,False,False,False,False,False,False,False,False
415,False,False,False,False,False,False,False,False,False,False,True,False
416,False,False,False,False,False,True,False,False,False,False,True,False
417,False,False,False,False,False,True,False,False,False,False,True,False

In [101]:
a.duplicated()

0      False
1      False
2      False
3      False
4      False
       ...
413    False
414    False
415    False
416    False
417    False
Length: 418, dtype: bool

In [102]:
a.drop_duplicates()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,0,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,1,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,0,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,0,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,1,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
413,1305,0,3,"Spector, Mr. Woolf",male,NaN,0,0,A.5. 3236,8.0500,NaN,S
414,1306,1,1,"Oliva y Ocana, Dona. Fermina",female,39.0,0,0,PC 17758,108.9000,C105,C
415,1307,0,3,"Saether, Mr. Simon Sivertsen",male,38.5,0,0,SOTON/O.Q. 3101262,7.2500,NaN,S
416,1308,0,3,"Ware, Mr. Frederick",male,NaN,0,0,359309,8.0500,NaN,S
417,1309,0,3,"Peter, Master. Michael J",male,NaN,1,1,2668,22.3583,NaN,C